Polished readme
